
## Plan Result




<pre><code>Plan: 24 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-DATABASE-SOURCE
  * azurerm_key_vault_secret.POSTGRES-HOST-SOURCE
  * azurerm_key_vault_secret.POSTGRES-PASS-DESTINATION
  * azurerm_key_vault_secret.POSTGRES-PASS-SOURCE
  * azurerm_key_vault_secret.POSTGRES-PORT-SOURCE
  * azurerm_key_vault_secret.POSTGRES-USER-DESTINATION
  * azurerm_key_vault_secret.POSTGRES-USER-SOURCE
  * azurerm_key_vault_secret.POSTGRES_DATABASE-DESTINATION
  * azurerm_key_vault_secret.POSTGRES_HOST-DESTINATION
  * module.flexible_database_destination.azurerm_postgresql_flexible_server.pgsql_server
  * module.flexible_database_destination.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.flexible_database_destination.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.flexible_database_destination.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.flexible_database_destination.azurerm_postgresql_flexible_server_database.pg_databases[&#34;toffee&#34;]
  * module.flexible_database_destination.azurerm_resource_group.rg[0]
  * module.flexible_database_destination.null_resource.set-user-permissions-additionaldbs[&#34;toffee&#34;]
  * module.flexible_database_destination.random_password.password
  * module.single_database_source.azurerm_postgresql_active_directory_administrator.admin
  * module.single_database_source.azurerm_postgresql_database.postgres-db
  * module.single_database_source.azurerm_postgresql_server.postgres-paas
  * module.single_database_source.azurerm_private_endpoint.postgres[0]
  * module.single_database_source.azurerm_resource_group.data-resourcegroup
  * module.single_database_source.null_resource.set-user-permissions[0]
  * module.single_database_source.random_password.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-DATABASE-SOURCE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-DATABASE-SOURCE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-DATABASE-SOURCE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST-SOURCE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST-SOURCE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-HOST-SOURCE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-DESTINATION will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-DESTINATION" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-PASS-DESTINATION"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-SOURCE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-SOURCE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-PASS-SOURCE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PORT-SOURCE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PORT-SOURCE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-PORT-SOURCE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-DESTINATION will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-DESTINATION" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-USER-DESTINATION"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-SOURCE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-SOURCE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-USER-SOURCE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-DESTINATION will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-DESTINATION" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-DATABASE-DESTINATION"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-DESTINATION will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST-DESTINATION" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-HOST-DESTINATION"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.flexible_database_destination.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "toffee-v14-flexible-destination-stg"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "toffee-v14-flexible-destination-data-stg"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Platform Operations"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.flexible_database_destination.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "toffee-v14-flexible-destination-data-stg"
      + server_name         = "toffee-v14-flexible-destination-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.flexible_database_destination.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_name      = "jenkins-ptl-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "toffee-v14-flexible-destination-data-stg"
      + server_name         = "toffee-v14-flexible-destination-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.flexible_database_destination.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.flexible_database_destination.azurerm_postgresql_flexible_server_database.pg_databases["toffee"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "toffee"
      + server_id = (known after apply)
    }

  # module.flexible_database_destination.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "toffee-v14-flexible-destination-data-stg"
      + tags     = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Platform Operations"
        }
    }

  # module.flexible_database_destination.null_resource.set-user-permissions-additionaldbs["toffee"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "name"           = "toffee-v14-flexible-destination"
          + "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        }
    }

  # module.flexible_database_destination.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.single_database_source.azurerm_postgresql_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + login               = "DTS Platform Operations"
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + resource_group_name = "toffee-v11-source-data-stg"
      + server_name         = "toffee-v11-source-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.single_database_source.azurerm_postgresql_database.postgres-db will be created
  + resource "azurerm_postgresql_database" "postgres-db" {
      + charset             = "utf8"
      + collation           = "en-GB"
      + id                  = (known after apply)
      + name                = "rhubarbv11"
      + resource_group_name = "toffee-v11-source-data-stg"
      + server_name         = "toffee-v11-source-stg"
    }

  # module.single_database_source.azurerm_postgresql_server.postgres-paas will be created
  + resource "azurerm_postgresql_server" "postgres-paas" {
      + administrator_login              = "rhubarbadmin"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = 35
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = true
      + id                               = (known after apply)
      + location                         = "uksouth"
      + name                             = "toffee-v11-source-stg"
      + public_network_access_enabled    = false
      + resource_group_name              = "toffee-v11-source-data-stg"
      + sku_name                         = "GP_Gen5_2"
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = 51200
      + tags                             = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Platform Operations"
        }
      + version                          = "11"
    }

  # module.single_database_source.azurerm_private_endpoint.postgres[0] will be created
  + resource "azurerm_private_endpoint" "postgres" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "toffee-stg-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "toffee-v11-source-data-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/iaas"
      + tags                     = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Platform Operations"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "postgres-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "toffee-stg-db"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.single_database_source.azurerm_resource_group.data-resourcegroup will be created
  + resource "azurerm_resource_group" "data-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "toffee-v11-source-data-stg"
      + tags     = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Platform Operations"
        }
    }

  # module.single_database_source.null_resource.set-user-permissions[0] will be created
  + resource "null_resource" "set-user-permissions" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "name"           = "toffee-v11-source"
          + "script_hash"    = "f6e30acec7d742bb8de09d51ea3724cedb22a597c641336ed4f8aecd58283229"
        }
    }

  # module.single_database_source.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 24 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":322,"Program":"tfcmt","SHA1":"","Vars":{}} -->